#include <WinAPI.au3>
#cs------------------------------------------------------------
功能说明：打开我的电脑并对我的电脑窗口进行操作
#ce------------------------------------------------------------
Send("#e")							;打开计算机窗口
WinWaitActive("计算机")		;定位到计算机窗口

Sleep(500)

;Start---------------------选中工具栏按两下下------------------------------
;Send("{tab 3}")						;发送3下tab到工具栏
;Send("{down}")					;按一下下
;Sleep(500)
;Send("{down}")
;End---------------------选中工具栏按两下下-------------------------------

;Start---------------------选中工具栏输入test------------------------------
;Send("{tab 2}")					;发送2下tab到查询框
;Send("test")							;输入字符test
;End---------------------选中工具栏输入test-------------------------------

;Send("{APPSKEY}")				;点击C盘右键菜单

;Start---------------------选中C盘符按下回车------------------------------
;Send("{tab 5}")					;发送5下tab选中C盘
;Send("{RIGHT}")
;Sleep(500)
;Send("{LEFT}")
;Sleep(500)
;Send("{ENTER}")
;End---------------------选中C盘符按下回车-------------------------------

;Start---------------------选中C盘符按下回车------------------------------
Send("{tab 4}")					;发送5下tab选中C盘
Send("{DOWN}")
Sleep(200)
Send("{RIGHT}")
Sleep(200)
Send("{DOWN}")
Sleep(200)
Send("{APPSKEY}")
;End---------------------选中C盘符按下回车-------------------------------

Sleep(1000)
WinClose("计算机")