#cs----------------------------------------------------------------------------------------------------------------------
创建日期：2016/04/07
作者：顾亚茹
功能说明：模拟查看和关闭windows服务的属性信息
修改日期：
修改人：
修改内容：
#ce-----------------------------------------------------------------------------------------------------------------------

#cs-----------------------------------------------------------------------------------------------------------------------
;查看和关闭windows服务的属性信息
parameters:
$path: 执行文件的路径                                       $title：窗口的标题
$count： 循环次数
#ce-----------------------------------------------------------------------------------------------------------------------
Func service_attributes($path,$title,$count)
	ShellExecute($path)
	Local $pid = WinWaitActive($title)
	Send("{TAB}")
	Sleep(500)
	for $i =1 to $count
		send("{APPSKEY}")
		Sleep(500)
		;For $j = 0 To 7
		Send("{DOWN 8}")
		Sleep(100)
		;Next
		Send("{ENTER}")
		Sleep(500)
		Send("{ESC}")
		Sleep(1000)
		Send("{DOWN}")
		Sleep(500)
	Next
	WinClose($pid)
EndFunc