#cs----------------------------------------------------------------------------------------------------------------------
创建日期：2016/04/28
作者：张泽方
功能说明：包含RightHandButton.au3遍历windows系统桌面右键菜单
修改日期：
修改人：
修改内容：
#ce-----------------------------------------------------------------------------------------------------------------------


#include "WindowTitle.au3"
#include "RightHandButton.au3"
#include  "ServiceWindow.au3"

;模拟点击鼠标右键
mouse_right("right",601,359,2,7)
right_cell("right",601,359,2,1,8,2)
right_cell("right",601,359,2,6,15,2)