#cs----------------------------------------------------------------------------------------------------------------------
创建日期：2016/04/28
作者：张泽方
功能说明：包含RightHandButton.au3,遍历windows系统开始菜单
修改日期：
修改人：
修改内容：
#ce-----------------------------------------------------------------------------------------------------------------------

#include "E:\RDPser2008\TitleAudit\RightHandButton.au3"

;遍历一级菜单及其右键内容，和遍历二级菜单
Local $listdown[22]=[6,0,0,0,0,0,0,0,0,0,0,4,7,7,4,2,0,0,0,0,0,0]
Local $subItem[1][2]
$subItem[0][0] = "18"
$subItem[0][1] = 25
click_start_all("^{esc}",1,22,$listdown)
Send("{ESC}")