#cs----------------------------------------------------------------------------------------------------------------------
创建日期：2016/04/07
作者：顾亚茹
功能说明：模拟查看和关闭windows服务的属性信息
修改日期：
修改人：
修改内容：
#ce-----------------------------------------------------------------------------------------------------------------------

#cs-----------------------------------------------------------------------------------------------------------------------
;查看和关闭windows服务的属性信息
parameters:
$site: 执行文件的路径                                       $Wdnname：窗口的标题
$n： 循环次数
#ce-----------------------------------------------------------------------------------------------------------------------
Func clickService($site,$Wdnname,$n)
	ShellExecute($site)
	Local $pid = WinWaitActive($Wdnname)
	Sleep(1000)
	for $i =1 to $n
		Send("{TAB}")
		send("{APPSKEY}")
		Sleep(1000)
		Send("{down 8}")
		Send("{enter}")
		Sleep(1000)
		Send("{esc}")
		Sleep(1000)
		Send("{down}")
		Sleep(1000)
	Next
	WinClose($pid)
EndFunc